<div class="content posters">

    <h2>Афиша </h2>
    <a href="/sea/concerts" class="posters_a"> Каталог всех концертов ... </a>
    <hr>

    <!--    ***********************************************************     А Ф И Ш Ы    **************************************************-->
    <div>
        <!--    *********************************************************** место для афиш    **************************************************-->


        <?php
        foreach ($posters as $jx):?>
            <div style="float: left;  ">
                <a class="fancybox" rel="group" href="/posters/<?= $jx->img1; ?>"
                   title='<a href="/sea/concert?id=<?= $jx->id; ?>">читать далее ... </a> '>
                    <img class="posters_a_img" src="/posters/preview/<?= $jx->img1; ?>" alt='' height="450"/><br>
                </a>

            </div>

        <?php
        endforeach;
        ?>
        <!--    *********************************************************** место для афиш    **************************************************-->
    </div>
    <!--    ***********************************************************      А Ф И Ш Ы    *******************************************************************-->

</div>