<!--    ***********************************************************     А Ф И Ш Ы    **************************************************-->
<div >
    <!--    *********************************************************** место для афиш    **************************************************-->
    <?php
    $x1 = db::s("select * from posters order by a4 desc ");

//  <!--    ***********************************************************   постраничная навигация    **************************************************-->
    $n = count($x1);  //  количесто афиш в базе
    $k = 4;   //  количество афиш на странице
    // расчет количества страниц  при $n афиш на странице   
    // ($n%$k)  возвращает 1 если есть дробный остаток и 0 если остатка нет
    if ($n % $k)
        $px = (integer) ($n / $k) + 1;
    else
        $px = $n / $k;
    $up = a::u()[1];
    if ($up != "")
        $p = (integer) $up;
    else
        $p = 1;

    $j1 = $p * $k - $k + 1; // начальная новость    
    $j2 = $p * $k;  // конечная новость

    $q = 1;

    $ar = array();
    foreach ($x1 as $a) {
        $ar[$q] = $a->id;
        $q++;
    }
//  <!--    ***********************************************************   постраничная навигация    **************************************************-->
    ?>  
    <div class="posters_n">

        <?php
        for ($i = 1; $i <= $px; $i++) {
            ?>   
            <div id="p" class="posters_p">

                <a href="/афиша/<?= $i ?>">
                    <?php
                    if ($i == $p)
                        echo "<span style=\"font-weight: bold;color: #f00; \">$i</span>";
                    else
                        echo $i;
                    ?>
                </a>
            </div>

            <?php
        }
        ?>
    </div> 

    <?php
    for ($j = $j1; $j <= $j2; $j++) {
        $id = $ar[$j];
        $q = "select * FROM  posters where id='$id'";
        $jx = db::r($q);
        if (isset($ar[$j])) {
            ?>
            <div style="float: left;  ">
                <a class="fancybox" rel="group" href="/posters/<?= $jx->img1; ?>" title='<a href="/концерт/<?= $jx->id; ?>">читать далее ... </a> '>
                    <img class="posters_a_img" src="/posters/preview/<?= $jx->img1; ?>" alt=''  height="450" /><br>
                </a>

            </div>


            <?php
        } else
            continue;
    }
    ?>
    <!--    *********************************************************** место для афиш    **************************************************-->
</div>
<!--    ***********************************************************      А Ф И Ш Ы    *******************************************************************-->




